class script(object):
    START_TXT = """<b>ʏᴏ.. ʏᴏ.. {}🙋,
ɪ'ᴍ <a href='https://t.me/Marshmello_Robot'>M̶ꪖ𝘳𝘴ꫝꪑꫀꪶꪶꪮ</a>, ʏᴏᴜ ᴄᴀɴ ᴜsᴇ ᴍᴇ ᴀs ᴀᴜᴛᴏ-ғɪʟᴛᴇʀ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ ....

ɪᴛs ᴇᴀsʏ ᴛᴏ ᴜsᴇ ᴍᴇ; ᴊᴜsᴛ ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴀs ᴀᴅᴍɪɴ, ᴛʜᴀᴛs ᴀʟʟ, ɪ ᴡɪʟʟ ᴘʀᴏᴠɪᴅᴇ ᴍᴏᴠɪᴇs ᴛʜᴇʀᴇ...🤓

©ᴍᴀɪɴᴛᴀɪɴᴇᴅ ʙ𝚢
     <a href='https://t.me/peace_fighter_TG'>»»»»»»»𝙿𝚎𝙰𝚌𝙴-𝙵𝚒𝙶𝚑𝚃𝚎𝚁-𝚃𝙶</a></b>
     """
    HELP_TXT = """𝙷𝙴𝚈 {}
𝙷𝙴𝚁𝙴 𝙸𝚂 𝚃𝙷𝙴 𝙷𝙴𝙻𝙿 𝙵𝙾𝚁 𝙼𝚈 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂."""
    ABOUT_TXT = """<b>♡︎ ᴍʏ ɴᴀᴍᴇ: <a href='https://t.me/marshmelloo_Robot'>M̶ꪖ𝘳𝘴ꫝꪑꫀꪶꪶꪮ</a>
♡︎ ᴄʀᴇᴀᴛᴏʀ: <a href='https://t.me/peace_fighter_TG'>𝙿ᴇ𝙰ᴄ𝙴-𝙵ɪ𝙶ʜ𝚃ᴇ𝚁-ᴛɢ</a>
♡︎ ᴄʀᴇᴅɪᴛs: ᴇᴠᴇʀʏᴏɴᴇ ɪɴ ᴛʜɪs ᴊᴏᴜʀɴᴇʏ
♡︎ ʟɪʙʀᴀʀʏ: <a href='https://docs.pyrogram.org/'>ᴘʏʀᴏɢʀᴀᴍ ᴀsʏɴᴄɪᴏ</a>
♡︎ ʟᴀɴɢᴜᴀɢᴇ: <a href='https://www.python.org/'>ᴘʏᴛʜᴏɴᴇ 3</a>
♡︎ ᴅᴀᴛᴀ ʙᴀsᴇ: <a href='https://www.mongodb.com/cloud'>ᴍᴀɴɢᴏ ᴅʙ</a>
♡︎ ʙᴏᴛ sᴇʀᴠᴇʀ: <a href='https://heroku.com/'>ʜᴇʀᴏᴋᴜ</a>
♡︎ sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ: <a href='https://t.me/NOKIERUNNOIPPKITTUM'>ᴄʟɪᴄᴋ ᴍᴇ 👈</a>
♡︎ ʙᴜɪʟᴅ sᴛᴀᴛᴜs: 𝚅7.6 [ ʙᴇᴛᴀ ]</b>"""
    SOURCE_TXT = """
    <b>എന്തായാലും ഇടുവരെ വന്ന സ്ഥിതിക്ക് ഇന്ന ഈ BUN 🥯 കയിച്ചിട്ട് പോയമദി 💁</b>

  


    """
    MANUELFILTER_TXT = """𝙷𝙴𝙻𝙿: <b>𝙵𝙸𝙻𝚃𝙴𝚁𝚂</b>

- ғɪʟᴛᴇʀ ɪs ᴀ ғᴜᴇᴛᴜʀᴇ ᴡᴇʀᴇ ᴜsᴇʀs ᴄᴀɴ sᴇᴛ ᴀᴜᴛᴏᴍᴀᴛᴇᴅ ʀᴇᴘʟᴀʏ ғᴏʀ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴋᴇʏᴡᴏʀᴅ ᴀɴᴅ ᴍᴀʀsʜᴍᴇʟʟᴏ ᴡɪʟʟ ʀᴇsᴘᴏɴᴅ ᴡʜᴇɴᴇᴠᴇʀ ᴀ ᴋᴇʏᴡᴏʀᴅ ɪs ғᴏᴜɴᴅ ᴛʜᴇ ᴍᴇssᴀɢᴇ

<b>NOTE:</b>
1. ᴍᴀʀsʜᴍᴇʟʟᴏ sʜᴏᴜʟᴅ ʜᴀᴠᴇ ᴀᴅᴍɪɴ ᴘʀɪᴠɪʟʟᴀɢᴇs.
2. ᴏɴʟʏ ᴀᴅᴍɪɴ ᴄᴀɴ ᴀᴅᴅ ғɪʟᴛᴇʀs ɪɴ ᴀ ɢʀᴏᴜᴘ.
3. ᴀʟᴇʀᴛ ʙᴜᴛᴛᴏɴ ʜᴀᴠᴇ ᴀ ʟɪᴍɪᴛ ᴏғ 64 ᴄʜᴀʀᴀᴄᴛᴇʀ.

<b>𝙲𝚊𝚖𝚖𝚊𝚗𝚍𝚜 𝙰𝚗𝚍 𝚄𝚜𝚊𝚐𝚎𝚜:</b>
• /filter - <code>ᴀᴅᴅ ᴀ ғɪʟᴛᴇʀ ɪɴ ᴄʜᴀᴛ</code>
• /filters - <code>ʟɪsᴛ ᴀʟʟ ғɪʟᴛᴇʀs ᴏғ ᴀ ᴄʜᴀᴛ</code>
• /del - <code>ᴅᴇʟᴇᴛᴇ ᴀ sᴘᴇᴄɪғɪᴄ ғɪʟᴛᴇʀ ɪɴ ᴄʜᴀᴛ</code>
• /delall - <code>ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ᴡʜᴏʟᴇ ғɪʟᴛᴇʀs ɪɴ ᴄʜᴀᴛ (ɢʀᴏᴜᴘ ᴏᴡɴᴇʀ ᴏɴʟʏ)</code>"""
    BUTTON_TXT = """Help: <b>𝙱𝚄𝚃𝚃𝙾𝙽𝚂</b>

- ᴍᴀʀsʜᴍᴇʟʟᴏ sᴜᴘᴘᴏʀᴛs ʙᴏᴛʜ ᴜʀʟ ᴀɴ ᴀʟᴇʀᴛ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴs.

<b>𝙽𝙾𝚃𝙴:</b>
1. Tᴇʟᴇɢʀᴀᴍ ᴡɪʟʟ ɴᴏᴛᴇ ᴀʟʟᴏᴡs ʏᴏᴜ ᴛᴏ sᴇɴᴅ ʙᴜᴛᴛᴏɴs ᴡɪᴛʜᴏᴜᴛ ᴀɴʏ ᴄᴏɴᴛᴇɴᴛs.sᴏ ᴄᴏɴᴛᴇɴᴛ ɪs ᴍᴀɴᴅᴀᴛᴏʀʏ.
2. ᴍᴀʀsʜᴍᴇʟʟᴏ sᴜᴘᴘᴏʀᴛs ʙᴜᴛᴛᴏɴs ᴡɪᴛʜ ᴀɴʏ ᴛᴇʟᴇɢʀᴀᴍ ᴍᴇᴅɪᴀ ᴛʏᴘᴇ.
3. ʙᴜᴛᴛᴏɴs sʜᴏᴜʟᴅ ʙᴇ ᴘʀᴏᴘᴇʀʟʏ ᴘᴀʀsᴇᴅ ᴀs ᴍᴀʀᴋᴅᴏᴡɴ ғᴏʀᴍᴀᴛᴇ.

<b>𝚄𝚁𝙻-𝙱𝚞𝚝𝚝𝚘𝚗𝚜:</b>
<code>[ʙᴜᴛᴛᴏɴ ᴛᴇxᴛ](buttonurl:https//t.me/Marshmelloo_Robot)</code>

<b>𝙰𝚕𝚎𝚛𝚝 𝙱𝚞𝚝𝚝𝚘𝚗𝚜:</b>
<code>[ʙᴜᴛᴛᴏɴ ᴛᴇxᴛ](buttonalert:This is an alert message)</code>"""
    AUTOFILTER_TXT = """𝙷𝙴𝙻𝙿: <b>𝙰𝚄𝚃𝙾 𝙵𝙸𝙻𝚃𝙴𝚁</b>

<b>𝙽𝙾𝚃𝙴:</b>
1. ᴍᴀᴋᴇ ᴍᴇ ᴛʜᴇ ᴀᴅᴍɪɴ ᴏғ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ɪғ ɪᴛs ᴘʀɪᴠᴀᴛᴇ.
2. ᴍᴀᴋᴇ sᴜʀᴇ ᴛʜᴀᴛ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴅᴏᴇs ɴᴏᴛᴄᴏɴᴛᴀɪɴs ᴄᴀᴍ ʀɪᴘs,ᴘᴏʀɴ ᴀɴᴅ ғᴀᴋᴇ ғɪʟᴇs.
3. ғᴏʀᴡᴀʀᴅ ᴍᴇ ᴛʜᴇ ʟᴀsᴛ ᴍᴇssᴀɢᴇ ғʀᴏᴍᴇ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴡɪᴛʜ ǫᴜᴇᴛᴇs.
 ɪ'ʟʟ ᴀᴅᴅ ᴀʟʟ ᴛʜᴇ ғɪʟᴇs ɪɴ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴍʏ ᴅʙ."""
    CONNECTION_TXT = """𝙷𝙴𝙻𝙿: <b>𝙲𝙾𝙽𝙽𝙴𝙲𝚃𝙸𝙾𝙽𝚂</b>

- ᴜsᴇᴅ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʙᴏᴛ ᴛᴏ ᴘᴍ ғᴏʀ ᴍᴀɴᴀɢɪɴɢ ғɪʟᴛᴇʀs ɪɴ ᴄʜᴀᴛ.
- ɪᴛ ʜᴇʟᴘs ᴛᴏ ᴀᴠᴏɪᴅᴇ sᴘᴀᴍɪɴɢ ɪɴ ɢʀᴏᴜᴘ.

<b>𝙽𝙾𝚃𝙴:</b>
1. ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴀᴅᴅ ᴀ ᴄᴏɴɴᴇᴄᴛɪᴏɴ.
2. Sᴇɴᴅ <code>/connect</code> ғᴏʀ ᴄᴏɴɴᴇᴄᴛɪɴɢ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ᴘᴍ.

<b>𝙲𝙰𝙼𝙼𝙰𝙽𝙳𝚂 𝙰𝙽𝙳 𝚄𝚂𝙰𝙶𝙴:</b>
• /connect  - <code>ᴄᴏɴɴᴇᴄᴛ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴄʜᴀᴛ ᴛᴏ ʏᴏᴜʀ ᴘᴍ</code>
• /disconnect  - <code>ᴅɪsᴄᴏɴɴᴇᴄᴛ ғʀᴏᴍᴇ ᴀ ᴄʜᴀᴛ</code>
• /connections - <code>ʟɪsᴛ ᴀʟʟ ʏᴏᴜʀ ᴄᴏɴɴᴇᴄᴛɪᴏɴs</code>"""
    EXTRAMOD_TXT = """𝙷𝙴𝙻𝙿: <b>𝙴𝚇𝚃𝚁𝙰 𝙼𝙾𝙳𝚄𝙻𝙴𝚂</b>

<b>𝙽𝙾𝚃𝙴:</b>
ᴛʜᴇsᴇ ᴀʀᴇ ᴛʜᴇ ᴇxᴛʀᴀ ғᴇᴜᴛᴜʀᴇs ᴏғ ᴍᴀʀsʜᴍᴇʟʟᴏ

<b>𝙲𝙰𝙼𝙼𝙰𝙽𝙳𝚂 𝙰𝙽𝙳 𝚄𝚂𝙰𝙶𝙴𝚂:</b>
• /id - <code>ɢᴇᴛ ɪᴅ ᴏғ ᴀ sᴘᴇᴄɪғɪᴄ ᴜsᴇʀ.</code>
• /info  - <code>ɢᴇᴛ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴀ ᴜsᴇʀ.</code>
• /imdb  - <code>ɢᴇᴛ ᴛʜᴇ ғɪʟᴍ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ғʀᴏᴍᴇ ɪᴍᴅʙ sᴏᴜʀᴄᴇ.</code>
• /search  - <code>ɢᴇᴛ ᴛʜᴇ ғɪʟᴍ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ғʀᴏᴍᴇ ᴠᴀʀɪᴏᴜs sᴏᴜʀᴄᴇs.</code>"""
    ADMIN_TXT = """𝙷𝙴𝙻𝙿: <b>𝙰𝙳𝙼𝙸𝙽 𝙼𝙾𝙳𝙴𝚂</b>

<b>𝙽𝙾𝚃𝙴:</b>
ᴛʜɪs ᴍᴏᴅᴜʟᴇs ᴏɴʟʏ ᴡᴏʀᴋ ғᴏʀ ᴀᴅᴍɪɴs.

<b>Commands and Usage:</b>
• /logs - <code>ᴛᴏ ɢᴇᴛ ᴛʜᴇ ʙᴏᴛ ʟᴏɢs</code>
• /stats - <code>ᴛᴏ ɢᴇᴛ sᴛᴀᴛᴜs ᴏғ ғɪʟᴇs ɪɴ ᴅʙ.</code>
• /users - <code>ᴛᴏ ɢᴇᴛ ʟɪsᴛ ᴏғ ᴍʏ ᴜsᴇʀs ᴀɴᴅ ɪᴅs.</code>
• /chats - <code>ᴛᴏ ɢᴇᴛ ʟɪsᴛ ᴏғ ᴍʏ ᴄʜᴀᴛs ᴀɴᴅ ɪᴅs </code>
• /leave  - <code>ᴛᴏ ʟᴇᴀᴠᴇ ғʀᴏᴍᴇ ᴀ ᴄʜᴀᴛ.</code>
• /disable  -  <code>ᴛᴏ ᴅɪsᴀʙʟᴇ ᴀ ᴄʜᴀᴛ.</code>
• /ban  - <code>ᴛᴏ ʙᴀɴ ᴀ ᴜsᴇʀ.</code>
• /unban  - <code>ᴛᴏ ᴜɴᴅᴀɴ ᴀ ᴜsᴇʀ.</code>
• /channel - <code>ᴛᴏ ɢᴇᴛ ʟɪsᴛ ᴏғ ᴛᴏᴛᴀʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟs</code>
• /broadcast - <code>ᴛᴏ ʙʀᴏᴅᴄᴀsᴛ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴜsᴇʀs</code>"""
    STATUS_TXT = """<b>★ 𝚃𝙾𝚃𝙰𝙻 𝙵𝙸𝙻𝙴𝚂: <code>{}</code>
★ 𝚃𝙾𝚃𝙰𝙻 𝚄𝚂𝙴𝚁𝚂: <code>{}</code>
★ 𝚃𝙾𝚃𝙰𝙻 𝙲𝙷𝙰𝚃𝚂: <code>{}</code>
★ 𝚄𝚂𝙴𝙳 𝚂𝚃𝙾𝚁𝙰𝙶𝙴: <code>{}</code> 𝙼𝚒𝙱
★ 𝙵𝚁𝙴𝙴 𝚂𝚃𝙾𝚁𝙰𝙶𝙴: <code>{}</code> 𝙼𝚒𝙱</b>"""
    LOG_TEXT_G = """<b>#𝙽𝙴𝚆𝙶𝚁𝙾𝚄𝙿
♡︎ 𝙶𝚁𝙾𝚄𝙿 = {}(<code>{}</code>)
♡︎ 𝚃𝙾𝚃𝙰𝙻 𝙼𝙴𝙼𝙱𝙴𝚁𝚂 = <code>{}</code>
♡︎ 𝙰𝙳𝙳𝙴𝙳 𝙱𝚈 - {}
</b>"""
    LOG_TEXT_P = """<b>#𝙽𝙴𝚆𝚄𝚂𝙴𝚁
♡︎ 𝙸𝙳 - <code>{}</code>
♡︎ 𝙽𝙰𝙼𝙴 - {}
</b>"""
